Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_sdhost_type.h
/**************************************************************************//**
 * @file      rtl8735b_sdhost_type.h
 * @brief    The register definitions of SD Host controller.
 * @version   V1.00
 * @date      2020-10-14 10:11:11
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#if 0
#ifndef _RTL8735B_SDHOST_TYPE_H_
#define _RTL8735B_SDHOST_TYPE_H_

#ifdef  __cplusplus
extern "C"
{
#endif

/// @cond DOXYGEN_GENERAL_REG_TYPE || DOXYGEN_SDIO_HOST_REG_TYPE

/**
 * @addtogroup hs_hal_sdio_host_reg SDIO_HOST Registers.
 * @ingroup hs_hal_sdio_host
 * @{
 */

/**
  \brief Union type to access sdio_host_sram_ctl (@ 0x00000400).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00000400) SRAM Control Register                                      */

	struct {
		__IOM uint32_t mem_region : 4;            /*!< [3..0] Set this bit to enable buffer SRAM direct access mode.             */
		__IOM uint32_t access_en  : 1;            /*!< [4..4] Set this bit to enable buffer SRAM direct access mode.             */
		__IOM uint32_t map_sel    : 1;            /*!< [5..5] 0: R-Bus = x01020304 => to flash 01, 02, 03, 04; 1: R-Bus
                                                   = x01020304 => to flash 04, 03, 02, 01                                    */
		__IOM uint32_t lx_burst_size : 2;         /*!< [7..6] Set the Lexra burst size. 0: 64 Bytes; 1: 128 Bytes;
                                                   2: 256 Bytes; 3: 128 Bytes                                                */
	} b;                                        /*!< bit fields for sdio_host_sram_ctl */
} sdio_host_sram_ctl_t, *psdio_host_sram_ctl_t;

/**
  \brief Union type to access sdio_host_dma_ctl1 (@ 0x00000404).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00000404) DMA Control Register 1                                     */

	struct {
		__IOM uint32_t dram_sa    : 28;           /*!< [27..0] Dram start address for DMA transfer. This information
                                                   will be map to addcmd. (8 Bytes Unit, 1 means 8B)                         */
	} b;                                        /*!< bit fields for sdio_host_dma_ctl1 */
} sdio_host_dma_ctl1_t, *psdio_host_dma_ctl1_t;

/**
  \brief Union type to access sdio_host_dma_ctl2 (@ 0x00000408).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00000408) DMA Control Register 2                                     */

	struct {
		__IOM uint32_t dma_len    : 16;           /*!< [15..0] Transfer length for DMA transfer between DMA buffer
                                                   and DDR. (512B Unit, 1 means 512B)                                        */
	} b;                                        /*!< bit fields for sdio_host_dma_ctl2 */
} sdio_host_dma_ctl2_t, *psdio_host_dma_ctl2_t;

/**
  \brief Union type to access sdio_host_dma_ctl3 (@ 0x0000040C).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x0000040C) DMA Control Register 3                                     */

	struct {
		__IOM uint32_t dma_xfer   : 1;            /*!< [0..0] Set this bit to transfer data between DRAM and DMA buffer.
                                                   Direction must be set at next bit. The transfer length
                                                   is reference to DMA_CTL2[15:0]. This bit will be auto clear
                                                   when transfer done.                                                       */
		__IOM uint32_t ddr_wr     : 1;            /*!< [1..1] 1: Move data from DMA buffer to DDR; 0: Move data from
                                                   DDR to DMA Buffer.                                                        */
		__IM  uint32_t            : 2;
		__IOM uint32_t rsp17_sel  : 1;            /*!< [4..4] For response is R2 case, reponse will transfer by dma
                                                   and not store in register. 1: dma count to 16byte and send
                                                   sb1_req; 0: normal case.                                                  */
		__IOM uint32_t dat64_sel  : 1;            /*!< [5..5] For CMD6 case, read data length is 64byte (less than
                                                   256 byte) 1: dma count to 64byte and send sb1_req; 0: normal
                                                   case.                                                                     */
	} b;                                        /*!< bit fields for sdio_host_dma_ctl3 */
} sdio_host_dma_ctl3_t, *psdio_host_dma_ctl3_t;

/**
  \brief Union type to access sdio_host_sys_low_pwr (@ 0x00000410).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00000410) Low Power Control Register                                 */

	struct {
		__IOM uint32_t dma_sram_rdy_num : 4;      /*!< [3..0] DMA SRAM ready cycle (leave sleep mode) (N+1) * clk_sys
                                                   period                                                                    */
		__IOM uint32_t dma_sram_lp_ena : 1;       /*!< [4..4] DMA SRAM low power enable                                          */
		__IM  uint32_t            : 1;
		__IOM uint32_t sys_clk_gate_ena : 1;      /*!< [6..6] DMA clk_sys gating enable                                          */
	} b;                                        /*!< bit fields for sdio_host_sys_low_pwr */
} sdio_host_sys_low_pwr_t, *psdio_host_sys_low_pwr_t;

/**
  \brief Union type to access sdio_host_sd_isr (@ 0x00000424).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00000424) SD Interrupt Status Register                               */

