Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_sdhost_type.h
	struct {
		__IOM uint32_t write_data : 1;            /*!< [0..0] 1 to set, 0 to clear bit with 1.                                   */
		__IOM uint32_t int1       : 1;            /*!< [1..1] SD Int1. Card End.                                                 */
		__IOM uint32_t int2       : 1;            /*!< [2..2] SD Int2. Card Error.                                               */
		__IM  uint32_t            : 1;
		__IOM uint32_t int4       : 1;            /*!< [4..4] SD Int4. DMA transfer done INT.                                    */
	} b;                                        /*!< bit fields for sdio_host_sd_isr */
} sdio_host_sd_isr_t, *psdio_host_sd_isr_t;

/**
  \brief Union type to access sdio_host_sd_isren (@ 0x00000428).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00000428) SD Interrupt Enable Register                               */

	struct {
		__IOM uint32_t write_data : 1;            /*!< [0..0] 1 to set, 0 to clear bit with 1.                                   */
		__IOM uint32_t int1en     : 1;            /*!< [1..1] SD Int1 Enable Card End INT Enable.                                */
		__IOM uint32_t int2en     : 1;            /*!< [2..2] SD Int2 Enable Card Error INT Enable.                              */
		__IM  uint32_t            : 1;
		__IOM uint32_t int4en     : 1;            /*!< [4..4] SD Int4 Enable dma_clr INT Enable.                                 */
	} b;                                        /*!< bit fields for sdio_host_sd_isren */
} sdio_host_sd_isren_t, *psdio_host_sd_isren_t;

/**
  \brief Union type to access sdio_host_pad_ctl (@ 0x00000474).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00000474) Pad Control Register                                       */

	struct {
		__IOM uint32_t tune3318   : 1;            /*!< [0..0] Pad select 3.3v or 1.8v. 1: 3.3v; 0: 1.8v                          */
	} b;                                        /*!< bit fields for sdio_host_pad_ctl */
} sdio_host_pad_ctl_t, *psdio_host_pad_ctl_t;

/**
  \brief Union type to access sdio_host_ckgen_ctl (@ 0x00000478).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00000478) Clock Generation Control Register                          */

	struct {
		__IOM uint32_t clk_div    : 3;            /*!< [2..0] 000: div1; 001: div2; 010: div4; 011: div8                         */
		__IM  uint32_t            : 1;
		__IOM uint32_t crc_clk_src : 2;           /*!< [5..4] 00: ssc_clk; 01: ssc_clk_vp0; 10: ssc_clk_vp1                      */
		__IM  uint32_t            : 2;
		__IOM uint32_t sd30_push_clk_src : 2;     /*!< [9..8] 00: ssc_clk; 01: ssc_clk_vp0; 10: ssc_clk_vp1                      */
		__IM  uint32_t            : 2;
		__IOM uint32_t sd30_sample_clk_src : 2;   /*!< [13..12] 00: ssc_clk; 01: ssc_clk_vp0; 10: ssc_clk_vp1                    */
		__IM  uint32_t            : 2;
		__IOM uint32_t crc_clk_change : 1;        /*!< [16..16] 0: from crc_clk_src; 1: clk4M                                    */
		__IOM uint32_t sd30_push_change : 1;      /*!< [17..17] 0: from sd30_push_clk_src; 1: clk4M                              */
		__IOM uint32_t sd30_sample_change : 1;    /*!< [18..18] 0: from sd30_sample_clk_src; 1: clk4M                            */
	} b;                                        /*!< bit fields for sdio_host_ckgen_ctl */
} sdio_host_ckgen_ctl_t, *psdio_host_ckgen_ctl_t;

/**
  \brief Union type to access sdio_host_card_drive_sel (@ 0x00000502).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x00000502) Card Driving Selection Register                            */

	struct {
		__IOM uint8_t cf_drive    : 2;            /*!< [1..0] CF Interface Drive. 00: 4mA; 01: 8mA; 10: 12mA; 11: 12mA           */
		__IOM uint8_t xd_drive    : 2;            /*!< [3..2] XD Interface Drive. 00: 4mA; 01: 8mA; 10: 12mA; 11: 12mA           */
		__IOM uint8_t sd_drive    : 2;            /*!< [5..4] SD DAT7~4 Interface Drive. 00: 4mA; 01: 8mA; 10: 12mA;
                                                   11: 12mA                                                                  */
		__IOM uint8_t ms_drive    : 2;            /*!< [7..6] MS Interface Drive. 00: 4mA; 01: 8mA; 10: 12mA; 11: 12mA           */
	} b;                                        /*!< bit fields for sdio_host_card_drive_sel */
} sdio_host_card_drive_sel_t, *psdio_host_card_drive_sel_t;

/**
  \brief Union type to access sdio_host_card_stop (@ 0x00000503).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x00000503) Stop Transfer Register                                     */

	struct {
		__IOM uint8_t cf_module   : 1;            /*!< [0..0] Target module is CF/MD card module. If set this bit the
                                                   transfer will be stop and the state machine of transfer
                                                   will return idle state.                                                   */
		__IOM uint8_t sm_module   : 1;            /*!< [1..1] Target module is SM/XD card module. If set this bit the
                                                   transfer will be stop and the state machine of transfer
                                                   will return idle state.                                                   */
		__IOM uint8_t sd_module   : 1;            /*!< [2..2] Target module is SD/MMC card module (SD). If set this
                                                   bit the transfer will be stop and the state machine of
                                                   transfer will return idle state.                                          */
		__IOM uint8_t ms_module   : 1;            /*!< [3..3] Target module is MS/MS-Pro/HG card module (MS). If set
                                                   this bit the transfer will be stop and the state machine
                                                   of transfer will return idle state.                                       */
		__IOM uint8_t sd2_module  : 1;            /*!< [4..4] Target module is SD/MMC card module (SD2). If set this
                                                   bit the transfer will be stop and the state machine of
                                                   transfer will return idle state.                                          */
		__IOM uint8_t ms2_module  : 1;            /*!< [5..5] Target module is MS/MS-Pro/HG card module (MS2). If set
                                                   this bit the transfer will be stop and the state machine
                                                   of transfer will return idle state.                                       */
	} b;                                        /*!< bit fields for sdio_host_card_stop */
} sdio_host_card_stop_t, *psdio_host_card_stop_t;

/**
  \brief Union type to access sdio_host_card_select (@ 0x0000050E).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x0000050E) Card Type Select Register                                  */

