Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_sdhost_type.h
	struct {
		__IOM uint8_t card_sel    : 3;            /*!< [2..0] Card Select. Specify the current active card module.
                                                   000: CF module 001: XD module 010: SD module 011: MS module
                                                   100: I2C module 101: Reserved 110: SD2 module 111: MS2
                                                   module                                                                    */
	} b;                                        /*!< bit fields for sdio_host_card_select */
} sdio_host_card_select_t, *psdio_host_card_select_t;

/**
  \brief Union type to access sdio_host_card_exist (@ 0x0000051F).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x0000051F) Card Detection Register                                    */

	struct {
		__IOM uint8_t cf_exist    : 1;            /*!< [0..0] CF Existence. If this bit is set it means CF/MD card
                                                   is in its socket.                                                         */
		__IOM uint8_t sm_exist    : 1;            /*!< [1..1] SM Existence. If this bit is set it means SM card is
                                                   in its socket.                                                            */
		__IOM uint8_t sd_exist    : 1;            /*!< [2..2] SD Existence. If this bit is set it means SD/MMC card
                                                   is in its socket.                                                         */
		__IOM uint8_t ms_exist    : 1;            /*!< [3..3] MS Existence. If this bit is set it means MS/MS-pro card
                                                   is in its socket.                                                         */
		__IOM uint8_t xd_exist    : 1;            /*!< [4..4] XD Existence. If this bit is set it means XD card is
                                                   in its socket.                                                            */
		__IOM uint8_t sd_wp       : 1;            /*!< [5..5] SD Write Protect. If this bit is set it means SD card
                                                   is mechanical write protected.                                            */
		__IOM uint8_t xd_wp       : 1;            /*!< [6..6] XD_WP Input. If the XD_WP pin is configure as input,
                                                   this bit reflect the level of XD_WP signal directly.                      */
	} b;                                        /*!< bit fields for sdio_host_card_exist */
} sdio_host_card_exist_t, *psdio_host_card_exist_t;

/**
  \brief Union type to access sdio_host_card_int_en (@ 0x00000520).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x00000520) Card Interrupt Enable Register                             */

	struct {
		__IOM uint8_t cf_int_en   : 1;            /*!< [0..0] CF Card Interrupt Enable. If this bit is set it enables
                                                   the interrupt of CF card                                                  */
		__IOM uint8_t sm_int_en   : 1;            /*!< [1..1] SM Card Interrupt Enable. If this bit is set it enables
                                                   the interrupt of SM card                                                  */
		__IOM uint8_t sd_int_en   : 1;            /*!< [2..2] SD/MMC Interrupt Enable. If this bit is set it enables
                                                   the interrupt of SD/MMC card                                              */
		__IOM uint8_t ms_int_en   : 1;            /*!< [3..3] MS/MS-pro/HG card Interrupt Enable. If this bit is set
                                                   it enables the interrupt of MS/MS-pro card                                */
		__IOM uint8_t xd_int_en   : 1;            /*!< [4..4] XD Card Interrupt Enable. If this bit is set it enables
                                                   the interrupt of XD card                                                  */
		__IOM uint8_t sd2_int_en  : 1;            /*!< [5..5] SD/MMC (SD2) Interrupt Enable. If this bit is set it
                                                   enables the interrupt of SD/MMC card                                      */
		__IOM uint8_t ms2_int_en  : 1;            /*!< [6..6] MS/MS-pro/HG (MS2) card Interrupt Enable. If this bit
                                                   is set it enables the interrupt of MS/MS-pro card                         */
		__IOM uint8_t gpio_int_en : 1;            /*!< [7..7] GPIO[0] Interrupt Enable. If this bit is set it enables
                                                   the interrupt of GPIO0                                                    */
	} b;                                        /*!< bit fields for sdio_host_card_int_en */
} sdio_host_card_int_en_t, *psdio_host_card_int_en_t;

/**
  \brief Union type to access sdio_host_card_int_pend (@ 0x00000521).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x00000521) Card Interrupt Status Register                             */

	struct {
		__IOM uint8_t cf_int_pend : 1;            /*!< [0..0] CF Card Interrupt Pending. If this bit is set it means
                                                   the interrupt of CF card is pending and write '1' to this
                                                   bit to clear the interrupt flag to '0'                                    */
		__IOM uint8_t sm_int_pend : 1;            /*!< [1..1] SM Card Interrupt Pending. If this bit is set it means
                                                   the interrupt of SM card is pending and write '1' to this
                                                   bit to clear the interrupt flag to '0'                                    */
		__IOM uint8_t sd_int_pend : 1;            /*!< [2..2] SD/MMC Interrupt Pending. If this bit is set it means
                                                   the interrupt of SD/MMC card is pending and write '1' to
                                                   this bit to clear the interrupt flag to '0'                               */
		__IOM uint8_t ms_int_pend : 1;            /*!< [3..3] MS/MS-pro/HG card Interrupt Pending. If this bit is set
                                                   it means the interrupt of MS/MS-pro card is pending and
                                                   write '1' to this bit to clear the interrupt flag to '0'                  */
		__IOM uint8_t xd_int_pend : 1;            /*!< [4..4] XD Card Interrupt Pending. If this bit is set it means
                                                   the interrupt of XD card is pending and write '1' to this
                                                   bit to clear the interrupt flag to '0'                                    */
		__IOM uint8_t sd2_int_pend : 1;           /*!< [5..5] SD/MMC (SD2) Interrupt Pending. If this bit is set it
                                                   means the interrupt of SD/MMC card is pending and write
                                                   '1' to this bit to clear the interrupt flag to '0'                        */
		__IOM uint8_t ms2_int_pend : 1;           /*!< [6..6] MS/MS-pro/HG (MS2) card Interrupt Pending. If this bit
                                                   is set it means the interrupt of MS/MS-pro card is pending
                                                   and write '1' to this bit to clear the interrupt flag to
                                                   '0'                                                                       */
		__IOM uint8_t gpio_int_pend : 1;          /*!< [7..7] GPIO[0] Interrupt Pending. If this bit is set it means
                                                   the interrupt of GPIO0 is pending and write '1' to this
                                                   bit to clear the interrupt flag to '0'                                    */
	} b;                                        /*!< bit fields for sdio_host_card_int_pend */
} sdio_host_card_int_pend_t, *psdio_host_card_int_pend_t;

/**
  \brief Union type to access sdio_host_card_clk_en_ctl (@ 0x00000529).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x00000529) Card Clock Enable Control Register                         */

