Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_sdhost_type.h
	struct {
		__IOM uint8_t cf_clk_en   : 1;            /*!< [0..0] CF Card Module Clock Enable Control. Disable clock can
                                                   save power. 0: Disable; 1: Enable                                         */
		__IOM uint8_t xd_clk_en   : 1;            /*!< [1..1] XD Card Module Clock Enable Control. Disable clock can
                                                   save power. 0: Disable; 1: Enable                                         */
		__IOM uint8_t sd_clk_en   : 1;            /*!< [2..2] SD Card Module Clock Enable Control. Disable clock can
                                                   save power. 0: Disable; 1: Enable                                         */
		__IOM uint8_t ms_clk_en   : 1;            /*!< [3..3] MS Card Module Clock Enable Control. Disable clock can
                                                   save power. 0: Disable; 1: Enable                                         */
		__IOM uint8_t sd2_clk_en  : 1;            /*!< [4..4] SD2 Card Module Clock Enable Control. Disable clock can
                                                   save power. 0: Disable; 1: Enable                                         */
		__IOM uint8_t ms2_clk_en  : 1;            /*!< [5..5] MS2 Card Module Clock Enable Control. Disable clock can
                                                   save power. 0: Disable; 1: Enable                                         */
		__IOM uint8_t sw_clk_mode : 1;            /*!< [6..6] Switch Clock Mode. Clk_en use FW configuration of HW
                                                   setting. 0: Clk_en use FW configure 1: Clk_en use HW setting              */
		__IOM uint8_t auto_cbw    : 1;            /*!< [7..7] Auto CBW Mode. Used for card select option. 0: Card select
                                                   is configured by FW. 1: Card select is configured by HW.                  */
	} b;                                        /*!< bit fields for sdio_host_card_clk_en_ctl */
} sdio_host_card_clk_en_ctl_t, *psdio_host_card_clk_en_ctl_t;

/**
  \brief Union type to access sdio_host_clk_pad_drive (@ 0x00000530).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x00000530) Clock Pad Driving Register                                 */

	struct {
		__IOM uint8_t nmos_drive  : 3;            /*!< [2..0] SD_CLK PAD NMOS drive select 3V3: 1V8: 000: x 10.1 x
                                                   1.93 001: x 13.5 x 3.85 010,100: x 16.9 x 5.78 011,101:
                                                   x 20.2 x 7.73 110: x 23.5 x 9.65 111: x 26.8 x 11.5                       */
		__IOM uint8_t pmos_drive  : 3;            /*!< [5..3] SD_CLK PAD PMOS drive select 3V3: 1V8: 000: x 7,07 x
                                                   2.27 001: x 14.2 x 4.61 010,100: x 21 x 6.68 011,101: x
                                                   27.9 x 9.14 110: x 34.9 x 11.5 111: x 42.4 x 13.8                         */
	} b;                                        /*!< bit fields for sdio_host_clk_pad_drive */
} sdio_host_clk_pad_drive_t, *psdio_host_clk_pad_drive_t;

/**
  \brief Union type to access sdio_host_cmd_pad_drive (@ 0x00000531).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x00000531) Command Pad Driving Register                               */

	struct {
		__IOM uint8_t nmos_drive  : 3;            /*!< [2..0] SD_CMD PAD NMOS drive select 3V3: 1V8: 000: x 10.1 x
                                                   1.93 001: x 13.5 x 3.85 010,100: x 16.9 x 5.78 011,101:
                                                   x 20.2 x 7.73 110: x 23.5 x 9.65 111: x 26.8 x 11.5                       */
		__IOM uint8_t pmos_drive  : 3;            /*!< [5..3] SD_CMD PAD PMOS drive select 3V3: 1V8: 000: x 7,07 x
                                                   2.27 001: x 14.2 x 4.61 010,100: x 21 x 6.68 011,101: x
                                                   27.9 x 9.14 110: x 34.9 x 11.5 111: x 42.4 x 13.8                         */
	} b;                                        /*!< bit fields for sdio_host_cmd_pad_drive */
} sdio_host_cmd_pad_drive_t, *psdio_host_cmd_pad_drive_t;

/**
  \brief Union type to access sdio_host_dat_pad_drive (@ 0x00000532).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x00000532) Data Pad Driving Register                                  */

	struct {
		__IOM uint8_t nmos_drive  : 3;            /*!< [2..0] SD_DAT[3:0] PAD NMOS drive select 3V3: 1V8: 000: x 10.1
                                                   x 1.93 001: x 13.5 x 3.85 010,100: x 16.9 x 5.78 011,101:
                                                   x 20.2 x 7.73 110: x 23.5 x 9.65 111: x 26.8 x 11.5                       */
		__IOM uint8_t pmos_drive  : 3;            /*!< [5..3] SD_DAT[3:0] PAD PMOS drive select 3V3: 1V8: 000: x 7,07
                                                   x 2.27 001: x 14.2 x 4.61 010,100: x 21 x 6.68 011,101:
                                                   x 27.9 x 9.14 110: x 34.9 x 11.5 111: x 42.4 x 13.8                       */
	} b;                                        /*!< bit fields for sdio_host_dat_pad_drive */
} sdio_host_dat_pad_drive_t, *psdio_host_dat_pad_drive_t;

/**
  \brief Union type to access sdio_host_sd_config1 (@ 0x00000580).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x00000580) SD Configuration Register 1                                */

	struct {
		__IOM uint8_t bus_width   : 2;            /*!< [1..0] 00: 1-bit bus 01: 4-bit bus 10: 8-bit bus 11: Reserved             */
		__IOM uint8_t mode_sel    : 2;            /*!< [3..2] 00: SD20 mode (single data rate; internal clock frequency
                                                   is 2 times as SD_CLK) 01: DDR mode (double data rate; internal
                                                   clock frequency is 2 times as SD_CLK) 10: SD30 mode (single
                                                   data rate; internal clock frequency is the same as SD_CLK;
                                                   sampling point turning can only be used in this mode) 11:
                                                   Reserved Note: When access SDR Card that needs to do sampling
                                                   turning, we must select SD30_mode; when access SDR Card
                                                   that needn't sampling turning, both SD20_mode and SD30_mode
                                                   is available.                                                             */
		__IOM uint8_t sd30_async_fifo_rst : 1;    /*!< [4..4] When SD30_mode is asserted, the input CMD/DAT will be
                                                   latched by an asynchronous FIFO. The write clock of FIFO
                                                   is sample clock; the read clock of FIFO is internal clock.
                                                   Write this bit to 1'b0 to reset write/read pointer of FIFO
                                                   after the frequency/phase of sample clock or internal clock
                                                   is changed.                                                               */
		__IM  uint8_t             : 1;
		__IOM uint8_t clk_div     : 1;            /*!< [6..6] Clock Divider (only available when initial mode is set)
                                                   0: SDCLK is divided by 128 1: SDCLK is divided by 256                     */
		__IOM uint8_t initial_mode : 1;           /*!< [7..7] Initial Mode (can not be used in SD30 mode) This bit
                                                   is used to control whether the SD clock will be divided
                                                   by clock divider 0: The SD clock can not be divided 1:
                                                   The SD clock will de divided by the value of Clock Divider                */
	} b;                                        /*!< bit fields for sdio_host_sd_config1 */
} sdio_host_sd_config1_t, *psdio_host_sd_config1_t;

/**
  \brief Union type to access sdio_host_sd_config2 (@ 0x00000581).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x00000581) SD Configuration Register 2                                */

