Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_sdhost_type.h
	struct {
		__IOM uint8_t rsp_type    : 2;            /*!< [1..0] Response Type Configure. 00: No response 01: 6-byte response
                                                   10: 17-byte response 11: Reserved                                         */
		__IOM uint8_t crc7_chk    : 1;            /*!< [2..2] CRC7 Check Enable. 0: Check CRC7 1: Not check CRC7                 */
		__IOM uint8_t wait_busy_end : 1;          /*!< [3..3] Wait busy End Enable If this bit is set, hardware will
                                                   wait (with SD_CLK continually toggling) till SD card is
                                                   ready (SD_DAT0 is 1). This bit is only available when HW
                                                   executes SEND_CMD_GET_RSP command code 0: .Not wait busy
                                                   end; HW will stop toggle SD clock after the command/response
                                                   transfer is completed, not concern about whether the SD_DAT0
                                                   is 1b or not 1: Wait busy end; HW will continue to toggle
                                                   SD clock if SD_DAT0 is 0b                                                 */
		__IOM uint8_t ignore_crc_sts_err : 1;     /*!< [4..4] Ignore Write CRC Error Enable. Set this bit to ignore
                                                   the write error. 0: Check whether CRC status returned by
                                                   card is correct 1: Not check whether CRC status returned
                                                   by card is correct                                                        */
		__IOM uint8_t wait_crc_sts_timeout : 1;   /*!< [5..5] Wait Write CRC Status Time Out Enable If this bit is
                                                   set, HW will check whether the write CRC status is sent
                                                   by card in time.(In SD3.0 spec, card should send the CRC
                                                   status within 8 clocks, HW will wait 16 clocks actually)
                                                   0: HW will Check whether the write CRC status is time-out
                                                   1: HW will Not Check whether the write CRC status is time-out             */
		__IOM uint8_t crc16_chk   : 1;            /*!< [6..6] CRC16 Check Enable. 0: Check CRC16 1: Not check CRC16              */
		__IOM uint8_t crc7_cal    : 1;            /*!< [7..7] CRC7 Calculation Enable. 0: Calculate CRC7 1: No calculation       */
	} b;                                        /*!< bit fields for sdio_host_sd_config2 */
} sdio_host_sd_config2_t, *psdio_host_sd_config2_t;

/**
  \brief Union type to access sdio_host_sd_config3 (@ 0x00000582).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x00000582) SD Configuration Register 3                                */

	struct {
		__IOM uint8_t rsp_timeout_en : 1;         /*!< [0..0] SD CMD Response Time Out Enable. If this bit is set,
                                                   HW will not check whether card's response to command is
                                                   time-out. It is considered to time-out if there is no SD
                                                   command response within 80 periods of SD_CLK after the
                                                   end bit of command is on the bus. 0: Not check whether
                                                   the response to command is time-out 1: Check whether the
                                                   response to command is time-out                                           */
		__IOM uint8_t addr_mode   : 1;            /*!< [1..1] Address mode. 0: sector address mode SD start data address
                                                   set in SD read/write command argument(CMD18/CMD25) equal
                                                   to (the start sector address) which is set in SCSI command
                                                   read10/write10; 1: byte mode SD start data address set
                                                   in SD read/write command argument(CMD18/CMD25) equal to
                                                   (the start sector address <<9)                                            */
		__IOM uint8_t rsp_chk     : 1;            /*!< [2..2] SD CMD Response Check Enable When in Random auto mode,
                                                   If this bit is set, HW will check whether card's response
                                                   is received correctly or not. When not in random auto mode,
                                                   this bit is useless. 0: No check whether the response of
                                                   command is correct 1: Check whether the response to command
                                                   is correct                                                                */
		__IOM uint8_t sd20_clk_stop : 1;          /*!< [3..3] SD20 Clock Stop After Data Transfer Over Enable. (Default
                                                   Disable) In order to conform to eMMC spec(NAC minimum value
                                                   is 2 SD Clock cycle), when this bit is 1'b1 and data transfer
                                                   is over(Sector Count is 0), SD clock(SD20 mode) is stopped
                                                   immediately. 0: Disable 1: Enable                                         */
		__IOM uint8_t sd30_clk_stop : 1;          /*!< [4..4] SD30 Clock Stop After Data Transfer Over Enable. (Default
                                                   Disable) In order to conform to eMMC spec(NAC minimum value
                                                   is 2 SD Clock cycle), when this bit is 1'b1 and data transfer
                                                   is over(Sector Count is 0), SD clock(SD30 SDR and DDR mode)
                                                   is stopped immediately. 0: Disable 1: Enable                              */
		__IOM uint8_t wait_card_idle : 1;         /*!< [5..5] Data Phase Wait Card busy Enable. When this bit is set
                                                   , wait until SD card not busy, then set sd_end. 0: No wait
                                                   SD card not busy, set sd_end immediately when data transfer
                                                   is over 1: Wait until SD card is not busy, then set sd_end                */
		__IOM uint8_t cmd_start_wait_card_idle : 1;/*!< [6..6] CMD Start Wait No Card busy. When this bit is set , no
                                                   wait card busy and send command immediately. 0: Wait until
                                                   card is not busy, then send the pending command 1: No wait
                                                   card busy and send command immediately                                    */
		__IOM uint8_t stop_cmd_start_wait_card_idle : 1;/*!< [7..7] STOP CMD Start No Wait Card busy. This bit is only valid
                                                   when the SD card controller is auto in random auto mode.
                                                   In random auto mode, SD card controller will auto send
                                                   stop cmd(CMD12) after read/write cmd(cmd18/cmd25), this
                                                   bit control whether HW wait busy end before send CMD12
                                                   When this bit is set , no wait card busy and send stop
                                                   command (CMD12) immediately. 0: Wait until card is not
                                                   busy, then send the stop command (CMD12) 1: No wait card
                                                   busy and send stop command immediately                                    */
	} b;                                        /*!< bit fields for sdio_host_sd_config3 */
} sdio_host_sd_config3_t, *psdio_host_sd_config3_t;

/**
  \brief Union type to access sdio_host_sd_status1 (@ 0x00000583).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x00000583) SD Status Register 1                                       */

