Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_sdhost_type.h
	struct {
		__IOM uint8_t tune_patrn_err : 1;         /*!< [0..0] SD Tuning Pattern Compare Error. This bit will be set
                                                   to 1'b1, if the tuning data sampled by HW is not correct.                 */
		__IOM uint8_t crc_sts_timeout_err : 1;    /*!< [1..1] Get Write CRC Status Time-out Error This bit will be
                                                   set to 1'b1, if SD card doesn't return write CRC status
                                                   bits to host within 8 SD_CLK cycles after the end bit of
                                                   data packet is on the bus (actually, HW will wait 16 clocks).             */
		__IOM uint8_t crc_sts_val : 3;            /*!< [4..2] Status Of Write CRC Status. This field reflects write
                                                   error bits returned from SD card. When card check CRC error,
                                                   it sends back CRC status (101); when card check CRC no
                                                   error, it sends back CRC status (010); when flash programming
                                                   error, CRC status read (111).                                             */
		__IOM uint8_t crc_sts_err : 1;            /*!< [5..5] Write CRC Error. This bit will be set to 1'b1, if the
                                                   write CRC status bits are not equal to 3'b010. (this means
                                                   Card detected CRC16 error in the data it received from
                                                   host).                                                                    */
		__IOM uint8_t crc16_err   : 1;            /*!< [6..6] CRC16 Error. This bit will be set to 1'b1, if there is
                                                   CRC16 check error in the data from SD card.                               */
		__IOM uint8_t crc7_err    : 1;            /*!< [7..7] CRC7 Error. This bit will be set to 1'b1, if there is
                                                   CRC7 check error in the response from SD card.                            */
	} b;                                        /*!< bit fields for sdio_host_sd_status1 */
} sdio_host_sd_status1_t, *psdio_host_sd_status1_t;

/**
  \brief Union type to access sdio_host_sd_status2 (@ 0x00000584).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x00000584) SD Status Register 2                                       */

	struct {
		__IOM uint8_t rsp_timeout_err : 1;        /*!< [0..0] SD CMD Response Timeout Error. This bit will be set to
                                                   1'b1, if there is no response within 80 periods of SD_CLK
                                                   after the end bit of command is on the bus.                               */
		__IOM uint8_t rsp_invalid : 1;            /*!< [1..1] SD CMD Response Invalid. If SD_CONFIGURE3 bit[2] is set,
                                                   this bit will reflect when the response is correct or not.
                                                   If this bit is set, sd_end and sd_error (SD_TRANSFER bit[6]
                                                   and bit[4]) will also be set 0: The response of command
                                                   is correct 1: The response to command is not correct                      */
		__IOM uint8_t cbw_state   : 4;            /*!< [5..2] CBW State Machine.                                                 */
	} b;                                        /*!< bit fields for sdio_host_sd_status2 */
} sdio_host_sd_status2_t, *psdio_host_sd_status2_t;

/**
  \brief Union type to access sdio_host_sd_bus_status (@ 0x00000585).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x00000585) SD Bus Status Register                                     */

	struct {
		__IOM uint8_t cmd         : 1;            /*!< [0..0] This bit reflect the level of pin SD_CMD.                          */
		__IOM uint8_t dat3_0      : 4;            /*!< [4..1] This bit reflect the level of pin SD_DAT3~SD_DAT0.                 */
		__IM  uint8_t             : 1;
		__IOM uint8_t stop_sdclk_when_no_xfer : 1;/*!< [6..6] Stop SD_CLK toggling when no cmd/data transfer (ignore
                                                   the level of SDDAT0)                                                      */
		__IOM uint8_t sdclk_toggle : 1;           /*!< [7..7] SD_CLK Toggle Enable. If this bit is set, host will generate
                                                   SDCLK toggle signal even when there is no signal transaction
                                                   on the CMD/DAT bus                                                        */
	} b;                                        /*!< bit fields for sdio_host_sd_bus_status */
} sdio_host_sd_bus_status_t, *psdio_host_sd_bus_status_t;

/**
  \brief Union type to access sdio_host_sd_cmd0 (@ 0x00000589).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x00000589) SD Command Register 0                                      */

	struct {
		__IOM uint8_t cmd         : 8;            /*!< [7..0] Command[47:40] or Response Data[47:40].                            */
	} b;                                        /*!< bit fields for sdio_host_sd_cmd0 */
} sdio_host_sd_cmd0_t, *psdio_host_sd_cmd0_t;

/**
  \brief Union type to access sdio_host_sd_cmd1 (@ 0x0000058A).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x0000058A) SD Command Register 1                                      */

	struct {
		__IOM uint8_t cmd         : 8;            /*!< [7..0] Command[39:32] or Response Data[39:32].                            */
	} b;                                        /*!< bit fields for sdio_host_sd_cmd1 */
} sdio_host_sd_cmd1_t, *psdio_host_sd_cmd1_t;

/**
  \brief Union type to access sdio_host_sd_cmd2 (@ 0x0000058B).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x0000058B) SD Command Register 2                                      */

