Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_sdhost_type.h
	struct {
		__IOM uint8_t cmd         : 8;            /*!< [7..0] Command[31:24] or Response Data[31:24].                            */
	} b;                                        /*!< bit fields for sdio_host_sd_cmd2 */
} sdio_host_sd_cmd2_t, *psdio_host_sd_cmd2_t;

/**
  \brief Union type to access sdio_host_sd_cmd3 (@ 0x0000058C).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x0000058C) SD Command Register 3                                      */

	struct {
		__IOM uint8_t cmd         : 8;            /*!< [7..0] Command[23:16] or Response Data[23:16].                            */
	} b;                                        /*!< bit fields for sdio_host_sd_cmd3 */
} sdio_host_sd_cmd3_t, *psdio_host_sd_cmd3_t;

/**
  \brief Union type to access sdio_host_sd_cmd4 (@ 0x0000058D).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x0000058D) SD Command Register 4                                      */

	struct {
		__IOM uint8_t cmd         : 8;            /*!< [7..0] Command[15:8] or Response Data[15:8].                              */
	} b;                                        /*!< bit fields for sdio_host_sd_cmd4 */
} sdio_host_sd_cmd4_t, *psdio_host_sd_cmd4_t;

/**
  \brief Union type to access sdio_host_sd_cmd5 (@ 0x0000058E).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x0000058E) SD Command Register 5                                      */

	struct {
		__IOM uint8_t cmd         : 8;            /*!< [7..0] Command[7:0] or Response Data[7:0].                                */
	} b;                                        /*!< bit fields for sdio_host_sd_cmd5 */
} sdio_host_sd_cmd5_t, *psdio_host_sd_cmd5_t;

/**
  \brief Union type to access sdio_host_sd_byte_cnt_l (@ 0x0000058F).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x0000058F) Byte Count Register (Low Byte)                             */

	struct {
		__IOM uint8_t byte_cnt_l  : 8;            /*!< [7..0] Byte Count[7:0]. Byte count in one block transferred
                                                   from/to SD card.                                                          */
	} b;                                        /*!< bit fields for sdio_host_sd_byte_cnt_l */
} sdio_host_sd_byte_cnt_l_t, *psdio_host_sd_byte_cnt_l_t;

/**
  \brief Union type to access sdio_host_sd_byte_cnt_h (@ 0x00000590).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x00000590) Byte Count Register (High Byte)                            */

	struct {
		__IOM uint8_t byte_cnt_h  : 3;            /*!< [2..0] Byte Count[10:8]. Byte count in one block transferred
                                                   from/to SD card.                                                          */
	} b;                                        /*!< bit fields for sdio_host_sd_byte_cnt_h */
} sdio_host_sd_byte_cnt_h_t, *psdio_host_sd_byte_cnt_h_t;

/**
  \brief Union type to access sdio_host_sd_blk_cnt_l (@ 0x00000591).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x00000591) Block Count Register (Low Byte)                            */

	struct {
		__IOM uint8_t blk_cnt_l   : 8;            /*!< [7..0] Block Count[7:0]. Block count transferred from/to SD
                                                   card.                                                                     */
	} b;                                        /*!< bit fields for sdio_host_sd_blk_cnt_l */
} sdio_host_sd_blk_cnt_l_t, *psdio_host_sd_blk_cnt_l_t;

/**
  \brief Union type to access sdio_host_sd_blk_cnt_h (@ 0x00000592).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x00000592) Block Count Register (High Byte)                           */

	struct {
		__IOM uint8_t blk_cnt_h   : 7;            /*!< [6..0] Block Count[14:8]. Byte count transferred from/to SD
                                                   card.                                                                     */
	} b;                                        /*!< bit fields for sdio_host_sd_blk_cnt_h */
} sdio_host_sd_blk_cnt_h_t, *psdio_host_sd_blk_cnt_h_t;

/**
  \brief Union type to access sdio_host_sd_xfer (@ 0x00000593).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x00000593) SD Transfer Control Register                               */

	struct {
		__IOM uint8_t cmd_code    : 4;            /*!< [3..0] Command Code. These bits encoded each working mode of
                                                   SD card control module. 0000(NORMAL_WRITE): Write 1 or
                                                   2 bytes to SD card and the content are put into SD_CMD2
                                                   & SD_CMD3 in advance. Hardware ignores write error returned
                                                   from SD card in this case. 0001(AUTO_WRITE3): Hardware
                                                   writes data from Ring buffer to SD card and the data length
                                                   is (SD_BYTE_CNT * SD_BLOCK_CNT). Hardware can only write
                                                   even bytes (2, 4, 6, ..., 512) data from SRAM2 buffer to
                                                   SD card if data source is consigned to SRAM2 buffer in
                                                   th                                                                        */
		__IOM uint8_t err         : 1;            /*!< [4..4] If this bit is set which means some error occurs detailed
                                                   error information is in register SD_STAT.                                 */
		__IOM uint8_t idle_ste    : 1;            /*!< [5..5] Status of SD card module state machine When this bit
                                                   is set 1, it means that the SD card module state machine
                                                   is in idle state.                                                         */
		__IOM uint8_t end         : 1;            /*!< [6..6] If transfer starts this bit will be clear automatically
                                                   by hardware. And if transfer completes this bit will be
                                                   set and keep 1 until the next Start is set.                               */
		__IOM uint8_t start       : 1;            /*!< [7..7] The transfer is launch if set this bit.                            */
	} b;                                        /*!< bit fields for sdio_host_sd_xfer */
} sdio_host_sd_xfer_t, *psdio_host_sd_xfer_t;

/**
  \brief Union type to access sdio_host_sd_cmd_ste (@ 0x00000595).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x00000595) SD Command State Register                                  */

