Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_sdhost_type.h
	struct {
		__IOM uint8_t cmd_ste     : 4;            /*!< [3..0] CMD State Machine                                                  */
		__IM  uint8_t             : 3;
		__IOM uint8_t cmd_ste_is_idle : 1;        /*!< [7..7] CMD State Machine is idle When this bit is 1'b1, it indicates
                                                   IDLE state of CMD State Machine                                           */
	} b;                                        /*!< bit fields for sdio_host_sd_cmd_ste */
} sdio_host_sd_cmd_ste_t, *psdio_host_sd_cmd_ste_t;

/**
  \brief Union type to access sdio_host_sd_data_ste (@ 0x00000596).
*/
typedef union {
	__IOM uint8_t w;                            /*!< (@ 0x00000596) SD Data State Register                                     */

	struct {
		__IOM uint8_t data_ste    : 5;            /*!< [4..0] DATA State Machine                                                 */
		__IM  uint8_t             : 2;
		__IOM uint8_t data_ste_is_idle : 1;       /*!< [7..7] DATA State Machine is idle When this bit is 1'b1, it
                                                   indicates IDLE state of DATA State Machine                                */
	} b;                                        /*!< bit fields for sdio_host_sd_data_ste */
} sdio_host_sd_data_ste_t, *psdio_host_sd_data_ste_t;

/** @} */ /* End of group hs_hal_sdio_host_reg */
/// @endcond /* End of condition DOXYGEN_GENERAL_REG_TYPE || DOXYGEN_SDIO_HOST_REG_TYPE */


#ifdef  __cplusplus
}
#endif

#endif    // end of #ifndef _RTL8735B_SDHOST_TYPE_H_

#endif
